sundar2012/Esp32-p4-dash/sdkconfig.defaults.esp32p4
# ESP32-P4 specific config
CONFIG_IDF_TARGET="esp32p4"

# CPU frequency
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=360

# PSRAM — ESP32-P4 hex PSRAM at 200MHz
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# L2 Cache — 128KB with 64-byte lines (critical for DPI performance)
CONFIG_CACHE_L2_CACHE_128KB=y
CONFIG_CACHE_L2_CACHE_LINE_64B=y

# MMU page size
CONFIG_MMU_PAGE_SIZE_64KB=y

# Flash
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
